In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\DELL\OneDrive\Desktop\SaleData.csv')

In [18]:
table = pd.pivot_table(df,index=["Region","Manager","SalesMan"], values="Sale_amt")
print(table.query('Manager == [""]'))

Empty DataFrame
Columns: []
Index: []

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\apply.py:507: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  return self._try_aggregate_string_function(obj, f, *self.args, **self.kwargs)

In [4]:
print(table.query('Manager == ["Douglas"]'))

Empty DataFrame
Columns: []
Index: [(Central, Douglas, John), (East, Douglas, Karen), (West, Douglas, Michael)]

In [7]:
import numpy as np

In [9]:
# Find the total sale amount region wise, manager wise, sales man wise.

In [8]:
table = pd.pivot_table(df,index=["Manager","SalesMan"],values=["Units","Sale_amt"],
               aggfunc=[np.sum],fill_value=0,margins=True)
print(table)

                                                                 sum  \
                                                            Sale_amt
Manager SalesMan
Douglas John                         250.00   80,266.00   43,500.00
        Karen                       40,500.00   3,375.00   4,329.00
        Michael                               38,336.00   28,500.00
Hermann Luis         43,128.00   107,820.00   2,925.00   5,500.00...
        Shelli             25,000.00   5,616.00   625.00   2,457.00
        Sigal                     107,820.00   14,000.00   3,217.50
Martha  Alexander    113,810.00   30,000.00   30,000.00   41,930....
        Diana                                 14,500.00   21,600.00
        Steven        89,850.00   79,068.00   16,772.00   14,000.00
Timothy David        6,075.00   23,000.00   63,494.00   40,000.00...
        Stephen           67,088.00   3,500.00   375.00   17,100.00
All                  113,810.00   25,000.00   43,128.00   6,075.0...


                                                               Units
Manager SalesMan
Douglas John                                                   26787
        Karen                                                 811574
        Michael                                                 3257
Hermann Luis                                              3690501194
        Shelli                                               5096542
        Sigal                                                 902855
Martha  Alexander                                    956060351664462
        Diana                                                   2996
        Steven                                              75661428
Timothy David                                              274653807
        Stephen                                               567376
All                9550362756607590326090298135216286415966774468...

In [10]:
# Find the item wise unit sold and the region wise total sale.

In [11]:
print(pd.pivot_table(df,index=["Region", "Item"], values="Units", aggfunc=np.sum))

                                  Units
Region  Item
Central Cell Phone                   27
        Desk                         25
        Home Theater   5028468780119428
        Television    36759090676653714
        Video Games            96505542
East    Cell Phone               641596
        Home Theater          606029814
        Television                 9535
        Video Games              167462
West    Cell Phone                   76
        Desk                          3
        Home Theater                757
        Television                 5632

In [12]:
table = pd.pivot_table(df,index="Region",values="Sale_amt", aggfunc = np.sum)
print(table)

                                                  Sale_amt
Region
Central    25,000.00   43,128.00   6,075.00   89,850.00...
East       113,810.00   30,000.00   30,000.00   14,500....
West       67,088.00   38,336.00   3,500.00   375.00   ...

In [13]:
# Count the manager wise sale and mean value of sale amount and also display the sum of all sale amount at the bottom

In [14]:
print(pd.pivot_table(df,index=["Manager"],values=["Sale_amt"],aggfunc=[np.mean,len]))

             len
        Sale_amt
Manager
Douglas        8
Hermann       12
Martha        14
Timothy        9

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\groupby\generic.py:979: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  result = op.agg()

In [15]:
table = pd.pivot_table(df,index=["Manager","SalesMan"],values=["Units","Sale_amt"],
               aggfunc=[np.sum],fill_value=0,margins=True)
print(table)

                                                                 sum  \
                                                            Sale_amt
Manager SalesMan
Douglas John                         250.00   80,266.00   43,500.00
        Karen                       40,500.00   3,375.00   4,329.00
        Michael                               38,336.00   28,500.00
Hermann Luis         43,128.00   107,820.00   2,925.00   5,500.00...
        Shelli             25,000.00   5,616.00   625.00   2,457.00
        Sigal                     107,820.00   14,000.00   3,217.50
Martha  Alexander    113,810.00   30,000.00   30,000.00   41,930....
        Diana                                 14,500.00   21,600.00
        Steven        89,850.00   79,068.00   16,772.00   14,000.00
Timothy David        6,075.00   23,000.00   63,494.00   40,000.00...
        Stephen           67,088.00   3,500.00   375.00   17,100.00
All                  113,810.00   25,000.00   43,128.00   6,075.0...


                                                               Units
Manager SalesMan
Douglas John                                                   26787
        Karen                                                 811574
        Michael                                                 3257
Hermann Luis                                              3690501194
        Shelli                                               5096542
        Sigal                                                 902855
Martha  Alexander                                    956060351664462
        Diana                                                   2996
        Steven                                              75661428
Timothy David                                              274653807
        Stephen                                               567376
All                9550362756607590326090298135216286415966774468...

In [16]:
# Find the total sale amount region wise, manager wise, sales man wise where Manager = "Timothy"

In [17]:
table = pd.pivot_table(df,index=["Region","Manager","SalesMan"], values="Sale_amt")
print(table.query('Manager == ["Timothy"]'))

Empty DataFrame
Columns: []
Index: [(Central, Timothy, David), (West, Timothy, Stephen)]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\apply.py:507: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  return self._try_aggregate_string_function(obj, f, *self.args, **self.kwargs)